hiperiondev/esp32idf_APRS/main/app_config.c
/**
 * @file app_config.c
 *
 * @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
 * @date 2026
 * @copyright GNU General Public License v3
 * @see https://github.com/hiperiondev/esp32idf_APRS
 *
 * @note
 * This is based on other projects:
 *     VP-Digi: https://github.com/sq8vps/vp-digi
 *     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
 *     LibAPRS: https://github.com/markqvist/LibAPRS
 *
 *     please contact their authors for more information.
 *
 * @brief Persistent application configuration: defaults, load/save of
 * /storage/config.json on LittleFS (via cJSON) and the global g_config instance
 * shared by every component and web admin page.
 */

#include <float.h>
#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "app_config.h"
#include "aprs_service.h" // RF_TX_BUFFERS_MIN/MAX - keeps the flash-load clamp for rf_tx_buffers in sync with the TX ring's real capacity, see the comment there
#include "cJSON.h"
// MODEM_PTT_ACTIVE_HIGH: the board's PTT polarity, #ifndef-guarded in that
// header and overridden from the top-level CMakeLists.txt. Both it and
// MODEM_PTT_GPIO (the PTT pin itself) are fixed compile-time constants with
// no g_config counterpart - see aprs_service_build_modem_config().
#include "esp32idf_radioamateur_modem_config.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_system.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"

static const char *TAG = "app_config";
#define CONFIG_PATH     "/storage/config.json"
#define CONFIG_TMP_PATH "/storage/config.json.tmp"

app_config_t g_config;

// Serializes every save/load of the underlying config.json file. Without
// this, two overlapping POSTs (e.g. a user clicking Save twice quickly, or a
// page auto-refresh racing a save) could both end up inside
// app_config_save() at once, doing redundant work and each rewriting the
// live config from under the other. (Note: esp_littlefs already takes a
// per-instance lock around every VFS op, so overlapping saves cannot corrupt
// the filesystem's own metadata - the intermittent memset/double-exception
// "save crash" was NOT this race but the stdio buffer allocation on the first
// write; see the setvbuf() note in app_config_save(). This mutex is kept
// because serializing saves is still correct, avoids wasted flash writes, and
// lets app_config_save() safely reuse a single static stdio buffer.) Created
// lazily so this file has no init-order dependency.
static SemaphoreHandle_t s_config_mutex = NULL;

static SemaphoreHandle_t config_mutex(void) {
    if (!s_config_mutex) {
        static portMUX_TYPE creation_lock = portMUX_INITIALIZER_UNLOCKED;
        taskENTER_CRITICAL(&creation_lock);
        if (!s_config_mutex)
            s_config_mutex = xSemaphoreCreateMutex();
        taskEXIT_CRITICAL(&creation_lock);
    }
    return s_config_mutex;
}

// Short-held lock guarding concurrent access to the live g_config struct
// itself. Distinct from s_config_mutex above (which is held across the entire
// flash serialization in app_config_save() and would stall readers): this one
// is a strict LEAF lock, only ever held long enough to mutate/copy a few
// fields. See the app_config_lock() contract in app_config.h. Created lazily
// with the same one-time-init guard as config_mutex().
static SemaphoreHandle_t s_data_mutex = NULL;

static SemaphoreHandle_t data_mutex(void) {
    if (!s_data_mutex) {
        static portMUX_TYPE creation_lock = portMUX_INITIALIZER_UNLOCKED;
        taskENTER_CRITICAL(&creation_lock);
        if (!s_data_mutex)
            s_data_mutex = xSemaphoreCreateMutex();
        taskEXIT_CRITICAL(&creation_lock);
    }
    return s_data_mutex;
}

void app_config_lock(void) {
    xSemaphoreTake(data_mutex(), portMAX_DELAY);
}

void app_config_unlock(void) {
    xSemaphoreGive(data_mutex());
}

static void set_str(char *dst, size_t sz, const char *val) {
    if (!val) {
        dst[0] = 0;
        return;
    }
    strncpy(dst, val, sz - 1);
    dst[sz - 1] = 0;
}

void app_config_set_defaults(app_config_t *c) {
    memset(c, 0, sizeof(*c));

    c->timeZone = 0.0f;
    c->synctime = true;
    c->cpuFreq = 240;

    set_str(c->my_callsign, sizeof(c->my_callsign), "NOCALL");
    c->my_lat = 0.0f;
    c->my_lon = 0.0f;
    c->my_alt = 0.0f;

    c->my_phg_power = 1;
    c->my_phg_gain = 6.0f;
    c->my_phg_height = 10;
    c->my_phg_dir = 0;
    set_str(c->my_phg, sizeof(c->my_phg), "");

    c->wifi_mode = 2; // AP_STA equivalent default (matches original shipping as AP)
    c->wifi_power = 20;
    for (int i = 0; i < WIFI_STA_NUM; i++) {
        c->wifi_sta[i].enable = false;
        set_str(c->wifi_sta[i].wifi_ssid, sizeof(c->wifi_sta[i].wifi_ssid), "WIFI_AP");
        set_str(c->wifi_sta[i].wifi_pass, sizeof(c->wifi_sta[i].wifi_pass), "");
    }
    c->wifi_ap_ch = 1;
    set_str(c->wifi_ap_ssid, sizeof(c->wifi_ap_ssid), "esp32idf_APRS");
    set_str(c->wifi_ap_pass, sizeof(c->wifi_ap_pass), "esp32idf_APRS");

    // IGATE
    c->igate_en = true;
    c->rf2inet = true;
    c->inet2rf = false;
    c->igate_loc2rf = false;
    c->igate_loc2inet = true;
    c->aprs_ssid = 10;
    c->aprs_port = 14580;
    set_str(c->aprs_mycall, sizeof(c->aprs_mycall), "NOCALL");
    set_str(c->aprs_passcode, sizeof(c->aprs_passcode), "-1");
    set_str(c->aprs_host, sizeof(c->aprs_host), "aprs.dprns.com");
    set_str(c->aprs_filter, sizeof(c->aprs_filter), "");
    c->igate_bcn = true;
    c->igate_lat = 0.000f;
    c->igate_lon = 0.000f;
    c->igate_alt = 0;
    c->igate_interval = 30;
    set_str(c->igate_symbol, sizeof(c->igate_symbol), "N&");
    c->igate_path = ACTIVATE_IGATE;
    set_str(c->igate_comment, sizeof(c->igate_comment), "esp32idf_APRS IGate");
    c->igate_sts_interval = 0;
    c->igate_phg_enable = false;
    c->igate_phg_use_station = false;
    c->igate_phg_power = 1;
    c->igate_phg_gain = 6.0f;
    c->igate_phg_height = 10;
    c->igate_phg_dir = 0;
    c->rf2inetFilter = IGATE_FILT_MESSAGE | IGATE_FILT_STATUS | IGATE_FILT_TELEMETRY | IGATE_FILT_WEATHER | IGATE_FILT_OBJECT | IGATE_FILT_ITEM |
                       IGATE_FILT_QUERY | IGATE_FILT_BUOY | IGATE_FILT_POSITION;
    c->inet2rfFilter = IGATE_FILT_MESSAGE;
    c->rf2inet_budlist_mode = BUDLIST_OFF;
    c->inet2rf_budlist_mode = BUDLIST_OFF;
    for (int i = 0; i < IGATE_BUDLIST_MAX; i++)
        set_str(c->budlist[i], sizeof(c->budlist[i]), "");
    c->rf2inet_range_en = false;
    c->rf2inet_range_km = 0.0f;
    c->rf2inet_prefix_en = false;
    set_str(c->rf2inet_prefixes, sizeof(c->rf2inet_prefixes), "");
    c->inet2rf_3rdparty_unwrap_en = false;

    // DIGI
    c->digi_en = false;
    c->digi_ssid = 1;
    set_str(c->digi_mycall, sizeof(c->digi_mycall), "NOCALL");
    c->digi_path = ACTIVATE_DIGI;
    c->digi_delay = 0;
    c->digi_bcn = true;
    c->digi_interval = 30;
    set_str(c->digi_symbol, sizeof(c->digi_symbol), "N&");
    set_str(c->digi_comment, sizeof(c->digi_comment), "esp32idf_APRS Digi");

