hiperiondev/esp32idf_APRS/main/app_config.c
    // TRACKER
    c->trk_en = false;
    c->trk_ssid = 9;
    set_str(c->trk_mycall, sizeof(c->trk_mycall), "NOCALL");
    c->trk_path = ACTIVATE_TRACKER;
    c->trk_interval = 60;
    c->trk_compress = false;
    set_str(c->trk_symbol, sizeof(c->trk_symbol), "\\>");
    set_str(c->trk_symmove, sizeof(c->trk_symmove), "/>");
    set_str(c->trk_symstop, sizeof(c->trk_symstop), "\\>");
    set_str(c->trk_comment, sizeof(c->trk_comment), "esp32idf_APRS Tracker");

    // WX
    c->wx_en = false;
    c->wx_ssid = 13;
    set_str(c->wx_mycall, sizeof(c->wx_mycall), "NOCALL");
    c->wx_path = ACTIVATE_WX;
    c->wx_interval = 300;
    set_str(c->wx_comment, sizeof(c->wx_comment), "ESP32APRS WX");
    // Enable the WX fields a typical station reports; the rest stay off until
    // the operator maps a sensor channel to them on the Weather page.
    //
    // wx_sensor_ch[] defaults to 0xFF ("(none)" - see page_wx.c's
    // wx_channel_select()/wx_field_present() and weather.c's
    // weather_refresh_now(), which both treat 0xFF as "no source channel
    // picked"). Channel 0 is a REAL registry slot (the first registered
    // driver), not a placeholder, so defaulting to 0 here would wire the
    // fields below straight to whatever driver happened to enumerate first -
    // transmitting live sensor data on first boot even though the operator
    // never mapped a channel in Sensor Mapping. Enable/Averaged/Channel must
    // all be explicitly set by the operator before a field is ever sampled or
    // put on-air; only Channel needs the non-zero default to make that true,
    // since weather_refresh_now() already skips any field whose channel is
    // 0xFF regardless of its Enable bit.
    for (int i = 0; i < WX_SENSOR_NUM; i++) {
        c->wx_sensor_enable[i] = false;
        c->wx_sensor_avg[i] = false;
        c->wx_sensor_ch[i] = 0xFF;
    }
    c->wx_sensor_enable[WX_FIELD_WIND_DIRECTION] = true;
    c->wx_sensor_enable[WX_FIELD_WIND_SPEED] = true;
    c->wx_sensor_enable[WX_FIELD_WIND_GUST] = true;
    c->wx_sensor_enable[WX_FIELD_TEMPERATURE] = true;
    c->wx_sensor_enable[WX_FIELD_HUMIDITY] = true;
    c->wx_sensor_enable[WX_FIELD_PRESSURE] = true;

    // Telemetry defaults live in telemetry_config_set_defaults()
    // (telemetry.c); telemetry configuration is not part of g_config.

    // AFSK / TNC
    c->audio_modem_en = true;
    c->audio_lpf = true;
    c->preamble = 300;
    c->afsk_modem_type = 1; // default 1200 Bd (AFSK/Bell202) - standard APRS audio modem
    c->fx25_mode = 0;
    c->tx_timeslot = 2000;
    c->rf_tx_buffers = 1;    // see RF_TX_BUFFERS_MIN/MAX in aprs_service.h
    c->ptt_min_unkey_ms = 0; // see PTT_MIN_UNKEY_MS_MIN/MAX in aprs_service.c
    set_str(c->ntp_host[0], sizeof(c->ntp_host[0]), "pool.ntp.org");
    set_str(c->ntp_host[1], sizeof(c->ntp_host[1]), "time.google.com");
    set_str(c->ntp_host[2], sizeof(c->ntp_host[2]), "time.cloudflare.com");
    c->ntp_resync_sec = 3600;

    // System / HTTP auth  (README documented default: admin/admin)
    set_str(c->http_username, sizeof(c->http_username), "admin");
    set_str(c->http_password, sizeof(c->http_password), "admin");
    set_str(c->host_name, sizeof(c->host_name), "esp32idf_APRS");
    c->reset_timeout = 0;
    for (int i = 0; i < 4; i++)
        set_str(c->path[i], sizeof(c->path[i]), "");
    set_str(c->path[0], sizeof(c->path[0]), "WIDE1-1,WIDE2-1");

    // Audio modem PTT.
    //
    // The modem component takes its ADC/DAC pins, PTT pin, PTT active level,
    // ADC attenuation and LED pins as compile-time constants (MODEM_* macros,
    // set in the top-level CMakeLists.txt). None of them are g_config fields
    // any more - see aprs_service_build_modem_config().

    // Message
    c->msg_enable = true;
    set_str(c->msg_mycall, sizeof(c->msg_mycall), "NOCALL");
    c->msg_path = 9;
    c->msg_rf = true;
    c->msg_inet = true;
    c->msg_retry = 3;
    c->msg_interval = 30;
    c->msg_alarm_enable = false; // disabled by default
    c->msg_alarm_gpio = -1;
}

// ---- streaming JSON writer -----------------------------------------------
// The configuration is serialized by writing tokens straight to the open
// config file, one field at a time, instead of first building a cJSON tree of
// the whole config in RAM and then printing that tree into a second full-size
// string buffer. On this device's small, fragmentable heap that old
// double-allocation (hundreds of tiny cJSON nodes, ~40+ KB, plus a ~7 KB
// contiguous print buffer, all live at once) was the single largest memory
// event in the firmware and was what drove the "minimum free heap" watermark
// down to a few KB after every save. Streaming keeps the extra RAM used during
// a save to essentially just littlefs's own write buffer.
//
// The schema has only one object level and single-level (scalar) arrays, so a
// single "need a comma before the next item" flag for each context is enough.
typedef struct {
    FILE *f;
    bool obj_comma; // a member has already been written at object level
    bool arr_comma; // an element has already been written in the current array
} jw_t;

// Emit a JSON string literal (quotes + minimal escaping), matching cJSON's
// unformatted escaping rules so values round-trip through cJSON_Parse on load.
static void jw_str_val(jw_t *w, const char *v) {
    fputc('"', w->f);
    if (v) {
        for (const unsigned char *p = (const unsigned char *)v; *p; p++) {
            unsigned char ch = *p;
            switch (ch) {
                case '"':
                    fputs("\\\"", w->f);
                    break;
                case '\\':
                    fputs("\\\\", w->f);
                    break;
                case '\b':
                    fputs("\\b", w->f);
                    break;
                case '\f':
                    fputs("\\f", w->f);
                    break;
                case '\n':
                    fputs("\\n", w->f);
                    break;
                case '\r':
                    fputs("\\r", w->f);
                    break;
                case '\t':
                    fputs("\\t", w->f);
                    break;
                default:
                    if (ch < 0x20)
                        fprintf(w->f, "\\u%04x", ch);
                    else
                        fputc(ch, w->f);
            }
        }
    }
    fputc('"', w->f);
}

