hiperiondev/esp32idf_APRS/main/app_config.c
    // Telemetry configuration (channel 0/1, Binary B1-B8 mapping) is no
    // longer part of config.json - see telemetry.h/.c and /storage/telemetry.json.

    jadd_str(d, "httpUser", c->http_username);
    jadd_str(d, "httpPass", c->http_password);
    jarr_begin(d, "path");
    for (int i = 0; i < 4; i++)
        jarr_str(d, c->path[i]);
    jarr_end(d);

    // rfPTT (PTT GPIO) and rfPTTAct (PTT active-high) are not serialized:
    // both are fixed compile-time constants (MODEM_PTT_GPIO /
    // MODEM_PTT_ACTIVE_HIGH), not stored settings.

    jadd_num(d, "logFile", c->log);
    jadd_str(d, "hostName", c->host_name);
    jadd_num(d, "resetTimeout", c->reset_timeout);

    jadd_bool(d, "msgEnable", c->msg_enable);
    jadd_str(d, "msgMycall", c->msg_mycall);
    jadd_bool(d, "msgUseStation", c->msg_use_station);
    jadd_bool(d, "msgRf", c->msg_rf);
    jadd_bool(d, "msgInet", c->msg_inet);
    jadd_num(d, "msgPath", c->msg_path);
    jadd_num(d, "msgRetry", c->msg_retry);
    jadd_num(d, "msgInterval", c->msg_interval);
    jadd_bool(d, "msgAlarmEn", c->msg_alarm_enable);
    jadd_num(d, "msgAlarmGpio", c->msg_alarm_gpio);

    fputc('}', d->f);
}

// ---- deserialize ------------------------------------------------------------
static void config_from_json(cJSON *d, app_config_t *c) {
    // Start from defaults so every key not present in an older config file
    // still ends up with a sane, documented value (never zero-garbage).
    app_config_t def;
    app_config_set_defaults(&def);
    *c = def;

    c->cpuFreq = (uint8_t)jget_num(d, "cpuFreq", def.cpuFreq);
    set_str(c->my_callsign, sizeof(c->my_callsign), jget_str(d, "myCallsign", def.my_callsign));
    c->my_lat = (float)jget_num(d, "myLAT", def.my_lat);
    c->my_lon = (float)jget_num(d, "myLON", def.my_lon);
    c->my_alt = (float)jget_num(d, "myALT", def.my_alt);
    c->my_phg_power = (uint16_t)jget_num(d, "myPHGPower", def.my_phg_power);
    c->my_phg_gain = (float)jget_num(d, "myPHGGain", def.my_phg_gain);
    c->my_phg_height = (uint16_t)jget_num(d, "myPHGHeight", def.my_phg_height);
    c->my_phg_dir = (uint8_t)jget_num(d, "myPHGDir", def.my_phg_dir);
    set_str(c->my_phg, sizeof(c->my_phg), jget_str(d, "myPHG", def.my_phg));
    c->tx_timeslot = (uint16_t)jget_num(d, "txTimeSlot", def.tx_timeslot);
    c->synctime = jget_bool(d, "syncTime", def.synctime);
    c->timeZone = (float)jget_num(d, "timeZone", def.timeZone);
    set_str(c->ntp_host[0], sizeof(c->ntp_host[0]), jget_str(d, "ntpHost0", jget_str(d, "ntpHost", def.ntp_host[0])));
    set_str(c->ntp_host[1], sizeof(c->ntp_host[1]), jget_str(d, "ntpHost1", def.ntp_host[1]));
    set_str(c->ntp_host[2], sizeof(c->ntp_host[2]), jget_str(d, "ntpHost2", def.ntp_host[2]));
    c->ntp_resync_sec = (uint16_t)jget_num(d, "ntpResync", def.ntp_resync_sec);
    if (c->ntp_resync_sec < NTP_RESYNC_MIN_SEC)
        c->ntp_resync_sec = NTP_RESYNC_MIN_SEC;
    c->wifi_mode = (uint8_t)jget_num(d, "WiFiMode", def.wifi_mode);
    c->wifi_power = (int8_t)jget_num(d, "WiFiPwr", def.wifi_power);
    c->wifi_ap_ch = (uint8_t)jget_num(d, "WiFiAPCH", def.wifi_ap_ch);
    set_str(c->wifi_ap_ssid, sizeof(c->wifi_ap_ssid), jget_str(d, "WiFiAP_SSID", def.wifi_ap_ssid));
    set_str(c->wifi_ap_pass, sizeof(c->wifi_ap_pass), jget_str(d, "WiFiAP_PASS", def.wifi_ap_pass));
    {
        cJSON *arr = cJSON_GetObjectItemCaseSensitive(d, "WiFiSTA");
        if (arr && cJSON_IsArray(arr)) {
            for (int i = 0; i < WIFI_STA_NUM; i++) {
                cJSON *e = cJSON_GetArrayItem(arr, i * 3);
                cJSON *s = cJSON_GetArrayItem(arr, i * 3 + 1);
                cJSON *p = cJSON_GetArrayItem(arr, i * 3 + 2);
                c->wifi_sta[i].enable = e ? cJSON_IsTrue(e) : false;
                set_str(c->wifi_sta[i].wifi_ssid, sizeof(c->wifi_sta[i].wifi_ssid), (s && cJSON_IsString(s)) ? s->valuestring : def.wifi_sta[i].wifi_ssid);
                set_str(c->wifi_sta[i].wifi_pass, sizeof(c->wifi_sta[i].wifi_pass), (p && cJSON_IsString(p)) ? p->valuestring : def.wifi_sta[i].wifi_pass);
            }
        }
    }

    c->fx25_mode = (uint8_t)jget_num(d, "fx25Mode", def.fx25_mode);
    c->afsk_modem_type = (uint8_t)jget_num(d, "afskModem", def.afsk_modem_type);
    c->preamble = (uint16_t)jget_num(d, "rfPreamble", def.preamble);
    c->audio_modem_en = jget_bool(d, "audioModemEn", def.audio_modem_en);
    c->audio_lpf = jget_bool(d, "audioLPF", def.audio_lpf);
    c->rf_tx_buffers = (uint8_t)jget_num(d, "rfTxBuffers", def.rf_tx_buffers);
    if (c->rf_tx_buffers < RF_TX_BUFFERS_MIN)
        c->rf_tx_buffers = RF_TX_BUFFERS_MIN;
    else if (c->rf_tx_buffers > RF_TX_BUFFERS_MAX)
        c->rf_tx_buffers = RF_TX_BUFFERS_MAX;
    c->ptt_min_unkey_ms = (uint16_t)jget_num(d, "pttMinUnkeyMs", def.ptt_min_unkey_ms);
    if (c->ptt_min_unkey_ms > 5000)
        c->ptt_min_unkey_ms = 5000;

    c->igate_en = jget_bool(d, "igateEn", def.igate_en);
    c->igate_bcn = jget_bool(d, "igateBcn", def.igate_bcn);
    c->rf2inet = jget_bool(d, "rf2inet", def.rf2inet);
    c->inet2rf = jget_bool(d, "inet2rf", def.inet2rf);
    c->igate_loc2rf = jget_bool(d, "igatePos2rf", def.igate_loc2rf);
    c->igate_loc2inet = jget_bool(d, "igatePos2inet", def.igate_loc2inet);
    c->rf2inetFilter = (uint16_t)jget_num(d, "rf2inetFilter", def.rf2inetFilter);
    // "inet2rfFiltger" was a legacy misspelling of the key used when saving;
    // fall back to it so configs written by older firmware still load correctly.
    c->inet2rfFilter = (uint16_t)jget_num(d, "inet2rfFilter", (double)jget_num(d, "inet2rfFiltger", def.inet2rfFilter));
    c->rf2inet_budlist_mode = (budlist_mode_t)jget_num(d, "rf2inetBudlistMode", def.rf2inet_budlist_mode);
    c->inet2rf_budlist_mode = (budlist_mode_t)jget_num(d, "inet2rfBudlistMode", def.inet2rf_budlist_mode);
    {
        cJSON *bl = cJSON_GetObjectItemCaseSensitive(d, "budlist");
        for (int i = 0; i < IGATE_BUDLIST_MAX; i++) {
            cJSON *v = bl ? cJSON_GetArrayItem(bl, i) : NULL;
            set_str(c->budlist[i], sizeof(c->budlist[i]), (v && cJSON_IsString(v)) ? v->valuestring : def.budlist[i]);
        }
    }
    c->rf2inet_range_en = jget_bool(d, "rf2inetRangeEn", def.rf2inet_range_en);
    c->rf2inet_range_km = (float)jget_num(d, "rf2inetRangeKm", def.rf2inet_range_km);
    c->rf2inet_prefix_en = jget_bool(d, "rf2inetPrefixEn", def.rf2inet_prefix_en);
    set_str(c->rf2inet_prefixes, sizeof(c->rf2inet_prefixes), jget_str(d, "rf2inetPrefixes", def.rf2inet_prefixes));
    c->inet2rf_3rdparty_unwrap_en = jget_bool(d, "inet2rf3rdPartyUnwrapEn", def.inet2rf_3rdparty_unwrap_en);
    c->aprs_ssid = (uint8_t)jget_num(d, "igateSSID", def.aprs_ssid);
    c->aprs_port = (uint16_t)jget_num(d, "igatePort", def.aprs_port);
    set_str(c->aprs_mycall, sizeof(c->aprs_mycall), jget_str(d, "igateMycall", def.aprs_mycall));
    c->igate_use_station = jget_bool(d, "igateUseStation", def.igate_use_station);
    set_str(c->aprs_passcode, sizeof(c->aprs_passcode), jget_str(d, "igatePasscode", def.aprs_passcode));
    set_str(c->aprs_host, sizeof(c->aprs_host), jget_str(d, "igateHost", def.aprs_host));
    set_str(c->aprs_filter, sizeof(c->aprs_filter), jget_str(d, "igateFilter", def.aprs_filter));
    c->igate_lat = (float)jget_num(d, "igateLAT", def.igate_lat);
    c->igate_lon = (float)jget_num(d, "igateLON", def.igate_lon);
    c->igate_alt = (float)jget_num(d, "igateALT", def.igate_alt);
    c->igate_interval = (uint16_t)jget_num(d, "igateINV", def.igate_interval);
    set_str(c->igate_symbol, sizeof(c->igate_symbol), jget_str(d, "igateSymbol", def.igate_symbol));
    set_str(c->igate_object, sizeof(c->igate_object), jget_str(d, "igateObject", def.igate_object));
    set_str(c->igate_phg, sizeof(c->igate_phg), jget_str(d, "igatePHG", def.igate_phg));
    c->igate_path = (uint8_t)jget_num(d, "igatePath", def.igate_path);
    set_str(c->igate_comment, sizeof(c->igate_comment), jget_str(d, "igateComment", def.igate_comment));
    c->igate_timestamp = jget_bool(d, "igateTimestamp", def.igate_timestamp);
    c->igate_phg_enable = jget_bool(d, "igatePHGEn", def.igate_phg_enable);
    c->igate_phg_use_station = jget_bool(d, "igatePHGUseStation", def.igate_phg_use_station);
    c->igate_phg_power = (uint16_t)jget_num(d, "igatePHGPower", def.igate_phg_power);
    c->igate_phg_gain = (float)jget_num(d, "igatePHGGain", def.igate_phg_gain);
    c->igate_phg_height = (uint16_t)jget_num(d, "igatePHGHeight", def.igate_phg_height);
    c->igate_phg_dir = (uint8_t)jget_num(d, "igatePHGDir", def.igate_phg_dir);
    c->igate_sts_interval = (uint16_t)jget_num(d, "igateSTSIntv", def.igate_sts_interval);
    set_str(c->igate_status, sizeof(c->igate_status), jget_str(d, "igateStatus", def.igate_status));

    c->digi_en = jget_bool(d, "digiEn", def.digi_en);
    c->digi_auto = jget_bool(d, "digiAuto", def.digi_auto);
    c->digi_loc2rf = jget_bool(d, "digiPos2rf", def.digi_loc2rf);
    c->digi_loc2inet = jget_bool(d, "digiPos2inet", def.digi_loc2inet);
    c->digi_timestamp = jget_bool(d, "digiTime", def.digi_timestamp);
    c->digi_ssid = (uint8_t)jget_num(d, "digiSSID", def.digi_ssid);
    set_str(c->digi_mycall, sizeof(c->digi_mycall), jget_str(d, "digiMycall", def.digi_mycall));
    c->digi_use_station = jget_bool(d, "digiUseStation", def.digi_use_station);
    c->digi_path = (uint8_t)jget_num(d, "digiPath", def.digi_path);
    c->digi_delay = (uint16_t)jget_num(d, "digiDelay", def.digi_delay);
    c->digiFilter = (uint16_t)jget_num(d, "digiFilter", def.digiFilter);
    c->digi_bcn = jget_bool(d, "digiBcn", def.digi_bcn);
    c->digi_alt = (float)jget_num(d, "digiAlt", def.digi_alt);
    c->digi_lat = (float)jget_num(d, "digiLAT", def.digi_lat);
    c->digi_lon = (float)jget_num(d, "digiLON", def.digi_lon);
    c->digi_interval = (uint16_t)jget_num(d, "digiINV", def.digi_interval);
    set_str(c->digi_symbol, sizeof(c->digi_symbol), jget_str(d, "digiSymbol", def.digi_symbol));
    set_str(c->digi_phg, sizeof(c->digi_phg), jget_str(d, "digiPHG", def.digi_phg));
    set_str(c->digi_comment, sizeof(c->digi_comment), jget_str(d, "digiComment", def.digi_comment));
    c->digi_sts_interval = (uint16_t)jget_num(d, "digiSTSIntv", def.digi_sts_interval);
    set_str(c->digi_status, sizeof(c->digi_status), jget_str(d, "digiStatus", def.digi_status));

