hiperiondev/esp32idf_APRS/main/app_config.c
    // Give the stream a fixed, known buffer BEFORE the first byte is written.
    // If we don't, newlib lazily allocates the stdio buffer on the first
    // fputc(), and it sizes that buffer from st_blksize - which esp_littlefs
    // reports as the 4096-byte flash block size. On this device's small,
    // fragmented heap that transient malloc(4096) is exactly what made saves
    // crash intermittently: when it can't be satisfied cleanly the stream
    // falls back to the unbuffered per-byte path (__swbuf_r) and a starved
    // heap trips a memset with a corrupted length - the double-exception /
    // corrupted-backtrace panic seen in the field. A small static buffer
    // removes that allocation entirely and, as a bonus, coalesces the
    // hundreds of token writes into a handful of block writes. Static (not on
    // the stack) and safe to reuse: every save is fully serialized by
    // config_mutex(), held across this whole function.
    static char s_save_buf[512];
    // INVARIANT: this static buffer is only safe to reuse because every save
    // is fully serialized by config_mutex(), held across this whole function.
    // If a future refactor ever removes/relaxes that mutex, this static
    // buffer becomes a re-entrancy hazard (concurrent saves would corrupt
    // each other's output) - assert the coupling holds, don't just comment it.
    configASSERT(xSemaphoreGetMutexHolder(config_mutex()) == xTaskGetCurrentTaskHandle());
    setvbuf(f, s_save_buf, _IOFBF, sizeof(s_save_buf));

    jw_t w = { .f = f, .obj_comma = false, .arr_comma = false };
    config_write_json(&w, &g_config);

    // Catch any deferred stdio/filesystem write error before committing the
    // temp file over the live one, so a full or failing filesystem can never
    // leave a truncated config.json in place.
    bool ok = (fflush(f) == 0) && (ferror(f) == 0);
    if (fclose(f) != 0)
        ok = false;
    if (!ok) {
        ESP_LOGE(TAG, "write error while saving config (free heap=%u bytes)", (unsigned)esp_get_free_heap_size());
        remove(CONFIG_TMP_PATH);
        xSemaphoreGive(config_mutex());
        return false;
    }

    remove(CONFIG_PATH);
    if (rename(CONFIG_TMP_PATH, CONFIG_PATH) != 0) {
        ESP_LOGE(TAG, "rename tmp->config failed");
        xSemaphoreGive(config_mutex());
        return false;
    }
    ESP_LOGI(TAG, "Configuration saved");
    // log how close the calling task (normally the
    // httpd task) came to overflowing its stack during this save, so the
    // config.stack_size in web_server.c can be sized from real numbers
    // instead of another guess. Remove once a safe margin is confirmed.
    ESP_LOGI(TAG, "Caller stack high-water mark: %u bytes free", (unsigned)(uxTaskGetStackHighWaterMark(NULL) * sizeof(StackType_t)));
    xSemaphoreGive(config_mutex());
    return true;
}

bool app_config_load(void) {
    FILE *f = fopen(CONFIG_PATH, "r");
    if (!f) {
        ESP_LOGW(TAG, "%s not found, writing defaults", CONFIG_PATH);
        app_config_set_defaults(&g_config);
        return app_config_save();
    }
    fseek(f, 0, SEEK_END);
    long sz = ftell(f);
    fseek(f, 0, SEEK_SET);
    if (sz <= 0) {
        fclose(f);
        ESP_LOGW(TAG, "config.json empty, writing defaults");
        app_config_set_defaults(&g_config);
        return app_config_save();
    }
    char *buf = malloc(sz + 1);
    if (!buf) {
        fclose(f);
        return false;
    }
    size_t rd = fread(buf, 1, sz, f);
    buf[rd] = 0;
    fclose(f);

    cJSON *doc = cJSON_Parse(buf);
    free(buf);
    if (!doc) {
        ESP_LOGW(TAG, "config.json corrupt, resetting to defaults");
        app_config_set_defaults(&g_config);
        return app_config_save();
    }
    config_from_json(doc, &g_config);
    cJSON_Delete(doc);
    ESP_LOGI(TAG, "Configuration loaded");
    return true;
}

bool app_config_factory_reset(void) {
    // Web-reachable (/default) at runtime, so it rewrites the whole g_config
    // out from under the beacon/igate/message tasks. Hold the data lock across
    // the wholesale rewrite so no reader can sample a half-reset struct; drop
    // it before the (slow, self-locking) flash save.
    app_config_lock();
    app_config_set_defaults(&g_config);
    app_config_unlock();
    return app_config_save();
}

uint8_t app_config_path_hop_count(uint8_t pathBitmask, const char pathPreset[4][72]) {
    uint8_t hops = 0;
    for (int bit = 0; bit < 4; bit++) {
        if (!(pathBitmask & (1u << bit)) || !pathPreset[bit][0])
            continue;
        hops++; // the alias itself is at least 1 hop
        for (const char *p = pathPreset[bit]; *p; p++)
            if (*p == ',')
                hops++;
    }
    return hops;
}

uint8_t app_config_path_mask_clamp(uint8_t pathBitmask, const char pathPreset[4][72]) {
    if (app_config_path_hop_count(pathBitmask, pathPreset) <= 8)
        return pathBitmask; // within budget already - nothing to drop

    // Over AX.25's 8-via limit once every selected preset's own comma-joined
    // hops are counted (e.g. two 4-hop presets can exceed 8 well before all 4
    // checkboxes are ticked). Keep presets low-bit-first until the budget is
    // used up and drop the rest, instead of silently saving a bitmask that
    // would later be clipped differently (or reach further than intended) at
    // transmit time - see beacon.c's buildPathSuffix(), which enforces the
    // same limit again as a belt-and-suspenders check for config loaded from
    // NVS/restore rather than this form.
    uint8_t clamped = 0;
    uint8_t hopsUsed = 0;
    for (int bit = 0; bit < 4; bit++) {
        if (!(pathBitmask & (1u << bit)) || !pathPreset[bit][0])
            continue;

        uint8_t presetHops = 1;
        for (const char *p = pathPreset[bit]; *p; p++)
            if (*p == ',')
                presetHops++;

        if (hopsUsed + presetHops > 8) {
            ESP_LOGW(TAG, "path bitmask 0x%02X exceeds AX.25 8-hop limit, dropping preset %d and beyond", pathBitmask, bit + 1);
            break;
        }
        clamped |= (uint8_t)(1u << bit);
        hopsUsed += presetHops;
    }
    return clamped;
}
